const carsQuestions = [

{
id:1,
title:"العلاقة بالآخرين (التفاعل الاجتماعي)",
description:"قياس مدى قدرة الطفل على التواصل البصري والتفاعل العاطفي والاجتماعي مع المحيطين به."
},

{
id:2,
title:"التقليد",
description:"تقييم قدرة الطفل على تقليد الحركات والأصوات والكلمات مقارنة بمن هم في عمره."
},

{
id:3,
title:"الاستجابة العاطفية",
description:"مدى تناسب ردود الفعل العاطفية للطفل مع المواقف المختلفة مثل الفرح أو الحزن أو الغضب."
},

{
id:4,
title:"استخدام الجسد",
description:"ملاحظة الحركات الجسدية غير المعتادة أو النمطية مثل رفرفة اليدين أو الدوران."
},

{
id:5,
title:"استخدام الأشياء",
description:"كيفية تعامل الطفل مع الألعاب والأشياء وهل يستخدمها بطريقة وظيفية أم يركز على أجزاء معينة منها."
},

{
id:6,
title:"التكيف مع التغيير",
description:"مدى تقبل الطفل لتغيير الروتين اليومي أو تغيير أماكن الأشياء."
},

{
id:7,
title:"الاستجابة البصرية",
description:"ملاحظة طريقة استخدام العينين والنظر للأشخاص أو الأشياء."
},

{
id:8,
title:"الاستجابة السمعية",
description:"ردود الفعل غير المعتادة تجاه الأصوات المختلفة."
},

{
id:9,
title:"استخدام وحاسة التذوق والشم واللمس",
description:"التفاعل مع المثيرات الحسية مثل الشم أو اللمس أو التذوق بطريقة غير معتادة."
},

{
id:10,
title:"الخوف أو القلق",
description:"ظهور مخاوف غير مبررة أو غياب الخوف الطبيعي في المواقف المختلفة."
},

{
id:11,
title:"التواصل اللفظي",
description:"تقييم استخدام الكلام للتواصل ومدى وجود ترديد أو استخدام غير وظيفي للكلام."
},

{
id:12,
title:"التواصل غير اللفظي",
description:"استخدام الإيماءات وتعبيرات الوجه ولغة الجسد للتعبير عن الاحتياجات."
},

{
id:13,
title:"مستوى النشاط",
description:"تقييم فرط الحركة أو الخمول مقارنة بالأطفال في نفس العمر."
},

{
id:14,
title:"مستوى التفكير والإدراك",
description:"تقييم الفهم والتركيز والإدراك العام للمواقف."
},

{
id:15,
title:"الانطباع العام (التقييم الكلي)",
description:"التقييم الشامل للمختص بناءً على الملاحظة الكلية لسلوك الطفل."
}

];